Tekla.Structures.ModelInternal.SummaryStatusEnum
See dbSharedObjectStatus_e

Tekla.Structures.ModelInternal.SummaryStatusEnum.INSERTED
Object inserted remotely, no conflicts

Tekla.Structures.ModelInternal.SummaryStatusEnum.UPDATED
Object updated remotely, no conflicts

Tekla.Structures.ModelInternal.SummaryStatusEnum.DELETED
Object deleted remotely, no conflicts

Tekla.Structures.ModelInternal.SummaryStatusEnum.MODIFIED_UPDATED
Object updated both remotely and locally

Tekla.Structures.ModelInternal.SummaryStatusEnum.MODIFIED_DELETED
Object updated locally and deleted remotely

Tekla.Structures.ModelInternal.SummaryStatusEnum.INSERTED_INSERTED
Object inserted both locally and remotely

Tekla.Structures.ModelInternal.SummaryStatusEnum.LOCAL
Object changed only locally.

Tekla.Structures.ModelInternal.SummaryStatusEnum.DELETED_MODIFIED
Object deleted locally and updated remotely